{
	"en": {
		"play": "PLAY",
		"SUCCESS": "SUCCESS!",
		"ERROR": "TRY AGAIN",
		"TEST": "TEST",
		"CONFIRM": "CONFIRM",
		"Start_Game": "Start Game",
		"Start_Mission": "START      MISSION",
		"Mission_Complete": "MISSION COMPLETE",
		"insert_coordinates": "INSERT COORDINATES",
		"Generate_Grid": "GENERATE GRID",
		"Deploy_Extractor": "DEPLOY EXTRACTOR",
		"Recover_Extractor": "RECOVER EXTRACTOR",
		"Repair_Extractor": "REPAIR EXTRACTOR",
		"Deploy_Pilon_1": "DEPLOY 1st PYLON",
		"Deploy_Pilon_2": "DEPLOY 2nd PYLON",
		"SeismicWardDeploying": "Seismic Ward is being deployed...",
		"RepairDroneDeploying": "Repair Drone is being deployed...",
		"PlasmaStormPilonDeploying_1": "First Pylon of the Plasma Wall is being deployed...",
		"PlasmaStormPilonDeploying_2": "Second Pylon of the Plasma Wall is being deployed...",
		"DeploySeismicWard": "DEPLOY SEISMIC WARD",
		"Alien_Attack_Start_1": "WARNING! An alien creature is moving towards the Extractor.",
		"Alien_Attack_Start_2": "Our sensor calculated that the creature will emerge at the coordinates written below. Please select the corresponding position on the grid and press Deploy Seismic Ward to defend the Extractor.",
		"Plasma_Storm_Start_1": "WARNING! The wind is pushing a nearby Plasma Storm in the direction of our Extractor.",
		"Plasma_Storm_Start_2": "Our sensors will now show the direction the storm is coming from. Please input the coordinates at which you want to deploy the 1st Pylon of the Plasma Wall. When you are done, press Deploy 1st Pylon.",
		"Plasma_Storm_Second_Pilon": "First Pylon in position. Please insert the coordinates of the other Pylon, then press Deploy 2nd Pylon to complete the Plasma Wall. Remember: the last Pylon must be placed 2 units away from the first one.",
		"AlienEmerging": "Alien creature reaching the surface in 3... 2... 1...",
		"BraceForPlasmaStorm": "Plasma Storm reaching the Extractor's position in 3... 2... 1...",
		"Alien_Pushed_Away_1": "Good job Captain! The Extractor is safe and the extraction process can continue.",
		"Alien_No_Obstacles": "Without a Seismic Ward, the creature can reach the Extractor without obstacles.",
		"Plasma_Storm_Ended_1": "The Plasma Storm has passed. The Plasma Wall has successfully protected the Extractor from the electric winds. Well done Captain.",
		"Extractor_Destroyed_1": "The Extractor has been damaged, and it won't be able to extract crystals until it is repaired.",
		"Deploy_Repair_Drone": "Please insert the coordinates at which you want to deploy the Repair Drone. Remember: the drone needs to land AROUND the Extractor, not on top of it. When you are ready, press the Repair Extractor button.",
		"ERROR_Repair_Drone_Missed_Target": "ERROR: the Repair Drone was unable to find an Extractor next to its landing position. Please try again.",
		"ERROR_Repair_Drone_Landed_On_Top": "ERROR: the Repair Drone cannot land on top of the Extractor, or it will damage it even more. Please try again and deploy the Repair Drone on a point AROUND the Extractor.",
		"ERROR_PlasmaWall_Same_Spot": "ERROR: the second Pylon cannot be placed on top of the first one. Instead, it needs to be placed at 2 UNITS of distance from the first Pylon on either the X or the Y axes. Please try again.",
		"ERROR_PlasmaWall_On_Extractor": "ERROR: a Plasma Pylon cannot be placed on top of an existing Extractor, otherwise both would get damaged. Please try again.",
		"ERROR_PlasmaWall_Invalid_Spot": "ERROR: the second Pylon cannot be placed at these coordinates. Instead, it needs to be placed at 2 UNITS of distance from the first Pylon on either the X or the Y axes. Please try again.",
		"Extractor_Repaired_1": "The Repair Drone has successfully repaired the Extractor. The extraction process has started again.",
		"Back_To_Map": "LEAVE ORBIT",
		"The_End": "END MISSION",
		"Lost_Something_To_Acid_1": "It seems the acid melted everything, without possibility of recovering any material. Looks like we will just have to build another one...",
		"Lost_Something_To_Acid_2": "...",
		"Extractor_Placement_Correct_1": "Success. The Extractor has now begun mining the deposit.",
		"Extraction_Ongoing": "The Extractor is harvesting a deposit. Please wait until the extraction is complete.",
		"Deposit_Emptied_1": "The Extractor has completed the extraction process. All the Xeno crystals in the current deposit have been extracted. We must now recover the Extractor and deploy it on another crystal deposit.",
		"Deposit_Emptied_2": "Please input the coordinates of the Extractor's position. When you are done, press Deploy Recovery Drone to send a drone to bring back the Extractor on the ship. ",
		"All_Deposits_Emptied_1": "All Xeno crystal deposits on this planet have been harvested successfully. Good job Captain. Now it is time to go back to orbit and move on to the next planet on our course.",
		"All_Deposits_Emptied_2": "When you are ready, press Leave Orbit to continue.",
		"intro_text_1": "Hello Captain, and welcome aboard of your spaceship. I am the EVA, the artificial intelligence installed on this ship. Let me load the details of your mission...",
		"intro_text_2": "DESTINATION: The Descartes solar system, the only place in the galaxy where it is possible to find the rare and precious mineral called XENO CRYSTAL.",
		"intro_text_3": "MISSION: Searching the 8 PLANETS of this solar system, extracting as many Xeno crystals as possible and finally delivering them to the closest space-colony, where they will be used to produce energy for their machines.",
		"intro_text_4": "However, before the mission can begin, the spaceship's sensors must be tested and calibrated. Start the calibration process when you are ready.",
		"calibration_sequence_1_text_1": "The mining machines on this ship operate using what is called a COORDINATE SYSTEM, which includes the grid and numbered lines you see on the monitor to the right.",
		"calibration_sequence_1_text_2": "The 2 perpendicular lines you see are called AXES. The horizontal axis (orange) is called the X AXIS, while the vertical one (blue) is called the Y AXIS.",
		"calibration_sequence_1_text_3": "As you can see, both X and Y axes have numbered points on them. The numbers on both axes begin counting from the point where the two lines cross, which is called ORIGIN",
		"calibration_sequence_1_text_4": "Please select the origin of the coordinate system on the right monitor to continue the calibration.",
		"calibration_sequence_2_text_1": "Correct! The numbers on each axis are used to indicate the distance of a point from the origin. The X numbers show the distance along the X axis, while the Y numbers show the distance along the Y axis.",
		"calibration_sequence_2_text_2": "For an example, please select the point I have marked on the grid.",
		"calibration_sequence_3_text_1": "I have added some guidelines to show the coordinates of this point. As you can see, the distance of this point from the origin is 3 units on the X axis (orange) and 4 units on the Y axis (blue).",
		"calibration_sequence_3_text_2": "These 2 numbers together are the COORDINATES that represent this point, and are written as (3, 4). The X coordinate is written first, followed by a comma, followed by the Y coordinate.",
		"calibration_sequence_3_text_3": "I have now marked 4 different points on the grid. Please select one of them to begin the calibration process.",
		"calibration_sequence_4_text_1": "The guidelines show you the coordinates of the selected point. Please write the coordinates, both X and Y, on the bottom-left monitor. When you are done, press Confirm.",
		"error_incomplete_coords": "ERROR: One or more coordinates are missing. Make sure to write a value for both coordinates (X and Y).",
		"error_no_spot_selected": "ERROR: No point on the grid has been selected. Please select the point of the grid that corresponds to the coordinates indicated in the bottom-left monitor.",
		"calibration_error_wrong_coords": "ERROR: Wrong coordinates. Follow the guidelines to see what the coordinates of this point are (orange for the X coordinate and blue for the Y coordinate). Press the Confirm button when you are done.",
		"calibration_correct_coords": "Coordinates correct! Please select another point.",
		"calibration_sequence_5_text_1": "Calibration complete. All mining systems on this spaceship are now calibrated and functioning, Captain. We are ready to begin the mission on your command.",
		"calibration_sequence_6_text_1": "Setting course for the Descartes planetary system.... Space engines at full power in 3...2...1...",
		"level_1_sequence_1_text_1": "We have reached the first planet of the Descartes system. We should examine the surface and search for Xeno crystals to extract.",
		"level_1_sequence_1_text_2": "Scanning the surface...",
		"level_1_sequence_2_text_1": "The spaceship's sensors have found an underground deposit of Xeno crystals. But before we can send one of our machines down there, we need to create a coordinate system to use as a reference.",
		"level_1_sequence_2_text_2": "Press the Generate Grid button to create an Origin and 2 axes.",
		"level_1_sequence_3_text_1": "Generating coordinate system...",
		"level_1_sequence_4_text_1": "Now that the grid is in place, it is possible to place one of our automatic EXTRACTORS on the deposit to start mining the Xeno Crystals.",
		"level_1_sequence_4_text_2": "Look at where the deposit is and input the corresponding X and Y coordinates in the bottom-left monitor. Then, when you are ready, press Deploy Extractor to send an Extractor at those coordinates.",
		"level_1_wrong_extractor_placement_text_1": "The Extractor was deployed at the wrong coordinates. We will have to deploy a RECOVERY DRONE on top of it to bring it back on the ship and re-deploy it.",
		"level_1_wrong_extractor_placement_text_2": "Please insert the coordinates of the position where the Extractor is right now. When you are done, press Recover Extractor to send a drone to those coordinates and pick the Extractor up.",
		"level_1_wrong_recovery_text_1": "The Recovery Drone did not find any Extractor to recover. Please try again.",
		"level_1_correct_recovery_text_1": "The Recovery Drone has successfully recovered the Extractor.",
		"level_1_correct_recovery_text_2": "Let's try again. Insert the coordinates of the Xeno crystal deposit into the bottom-left monitor. When you are done, press Deploy Extractor.",
		"level_1_sequence_5_text_1": "The Extractor has landed on the deposit and has started to mine the xeno crystals inside of it. The extraction will continue automatically until the entire deposit is empty.",
		"level_1_sequence_5_text_2": "The bar at the top shows you the progress of the extraction (when the bar is full, the deposit is empty). Please wait until the Extractor has finished its job.",
		"level_1_sequence_6_text_1": "The Extractor has mined all the xeno crystals in the deposit. Our job on this planet is done Captain. Press the Leave Orbit button when you are ready to continue to the next planet on our course.",
		"level_2_sequence_1_text_1": "We have reached the second planet of the system, Captain. However, the spaceship's sensors are detecting signs of ALIEN LIFEFORMS living under the surface of this planet.",
		"level_2_sequence_1_text_2": "We don't know how aggressive these creatures are, but it seems that they are big enough to cause severe damage to our machines. Therefore, caution is highly suggested.",
		"level_2_sequence_1_text_3": "Ready to generate the Coordinate Grid on your command, Captain.",
		"level_2_sequence_2_text_1": "Coordinate Grid generated successfully. Please insert the coordinates at which you want the Extractor to be deployed. When you are done, press the Deploy Extractor button.",
		"level_2_sequence_3_text_1": "The Extractor has begun to harvest crystals. Please wait until the process is complete...",
		"level_2_sequence_4_text_1": "WARNING! An alien creature is moving towards the Extractor. Captain, we must be quick and deploy a SEISMIC WARD, a robotic turret that can create small earthquakes to scare that creature away.",
		"level_2_sequence_4_text_2": "Our sensors can estimate the coordinates at which the creature will emerge, but you will have to place the Ward manually at those coordinates by selecting the correct point on the grid.",
		"level_2_sequence_4_text_3": "Look at the coordinates shown on the bottom-left monitor and select the corresponding point on the grid to the right. When you have selected the point, press the Deploy Seismic Ward button.",
		"level_2_Ward_Failure_text_1": "It seems that the Seismic Ward was not placed properly. The creature managed to reach our Extractor and deal enough damage to shut it down and interrupt the extraction process.",
		"level_2_Ward_Failure_text_2": "If we want to start the extraction process again, we need to send a REPAIR DRONE to the surface and place it at any position that is IMMEDIATELY AROUND the Extractor, but NOT on top of it.",
		"level_2_Ward_Failure_text_3": "...",
		"level_3_sequence_1_text_1": "We have reached the third planet. According to our sensors, this planet seems to have twice as many Xeno crystal deposits as the last one. It is up to you, Captain, to decide which one you want to start with.",
		"level_3_sequence_1_text_2": "Just remember that, no matter which deposit you start from, the mission won't be complete until all deposits on the surface are mined completely. The Extractor is ready to be deployed at your command.",
		"level_4_sequence_1_text_1": "We have reached the fourth planet on our course. From this point forward, as we get closer to the sun, we might encounter extreme weather conditions called PLASMA STORMS, which can seriously damage our machines.",
		"level_4_sequence_1_text_2": "Let us proceed then. The faster we mine those deposits, the faster we can leave those storms behind. Ready to deploy the Extractor at your command, Captain.",
		"level_4_Storm_Tutorial_1_text_1": "WARNING! The electrical energy in the atmosphere is building up into a Plasma Storm not far away from our position.",
		"level_4_Storm_Tutorial_1_text_2": "Our sensors are detecting that the wind is blowing in our direction, and that the storm will soon reach the position of our Extractor. We need to protect our Extractor with a PLASMA WALL.",
		"level_4_Storm_Tutorial_1_text_3": "A Plasma Wall is a wall of energy that connects 2 separate PYLONS. We will need to manually place both of those pylons in a way that creates a barrier between the Extractor and the wind.",
		"level_4_Storm_Tutorial_1_text_4": "This time, our sensors are able to automatically suggest us the coordinates where we should place the first Pylon. Please press Deploy 1st Pylon to continue.",
		"level_4_Storm_Tutorial_2_text_1": "Good, we have just one more Pylon left. Remember Captain: the SECOND Pylon can only be placed at 2 UNITS of distance from the first, either on the X axis or on the Y axis, or else it won't work.",
		"level_4_Storm_Tutorial_2_text_2": "Please insert the coordinates at which you want to deploy the second Pylon. Remember Captain that the wind is coming from the TOP side. When you are ready, press Deploy 2nd Pylon to continue.",
		"level_4_Incorrect_Second_Pilon_1": "These coordinates are valid, Captain, but if we place the 2nd Pylon here the wall will not protect the Extractor from the wind that's coming FROM THE TOP. Please try again.",
		"level_5_sequence_1_text_1": "We have landed on the fifth planet of the system, Captain. This planet seems to have quite a few deposits of Xeno crystals, but also quite a few Plasma Storms constantly roaming across the surface.",
		"level_5_sequence_1_text_2": "Better be ready to deploy our Pylons and shield our Extractor from those winds. With that said, all systems are operational, Captain. We are ready to deploy the Extractor on your command.",
		"level_6_sequence_1_text_1": "We have reached the sixth planet, Captain, and it seems to be another one rich in Xeno crystals. However, according to our information, the extraction process on this planet won't be easy...",
		"level_6_sequence_1_text_2": "This time it seems we will have to keep an eye out for both Alien Attacks AND Plasma Storms, so you better prepare yourself Captain. All systems are operational and ready at your command.",
		"level_7_sequence_1_text_1": "Captain, we have reached the seventh planet, the second-to-last on our course. This is reported to be the second most dangerous planet of the system, due to the numerous ACID POOLS that cover its surface.",
		"level_7_sequence_1_text_2": "If any of our machines were to fall into one of those pools, they would be quickly dissolved by the acid and we would have to build new ones on board of the ship. Therefore, we better be extra careful.",
		"level_7_sequence_1_text_3": "And that's not all: our sensors are detecting some Alien Lifeforms somehow living here despite the powerful acid water. Whenever you are ready Captain, all systems are prepared to begin the extraction.",
		"level_8_sequence_1_text_1": "Here we are, Captain: the eighth and last planet of the Descartes system. Once all the deposits on this planets are empty, our mission will be complete.",
		"level_8_sequence_1_text_2": "This planet will most likely be the most challenging one we have seen. Due to it being the closest to the sun, all sorts of dangers are to be expected: alien creatures, plasma storms AND acid pools all in one.",
		"level_8_sequence_1_text_3": "With that said, we have successfully managed to arrive to this point, and there is no reason to stop now. Once more, Captain, all systems are ready to begin the extraction at your command.",
		"level_8_finale_1": "Great job Captain! The mission is COMPLETE and we can now go back to the outpost and deliver our precious cargo. The citizens of the colony will have enough Xeno crystals to keep their machines running for months.",
		"level_8_finale_2": "It has been a great pleasure to assist you in this journey, Captain. I hope we will get to work together again in the future. Until then, safe travels and good luck!"
	}
}